[
  {
    "name": "506th Airborne Infantry Regiment Association",
    "website": "https://web.archive.org/web/20080705103404/http://www.506infantry.org/member.html",
    "phone": null,
    "summary": "The 506th Airborne Infantry Regiment Association (Airmobile – Air Assault) is a non-profit American veterans' organization of the U.S. Army 506th Airborne Infantry Regiment.   It has approximately 3,600 members, including veterans from the regiment's founding in 1942."
  },
  {
    "name": "1971 Vietnam veteran medal throwing protest",
    "website": "https://books.google.com/books?id=r_cTCgAAQBAJ&dq=%22Rogers%2C+who+could+step+tomorrow+into+a+Wheaties+ad%22&pg=PA15",
    "phone": null,
    "summary": "On April 23, 1971 Vietnam Veterans Against the War staged what was arguably \"one of the most dramatic and influential events of the antiwar movement\" as hundreds of Vietnam veterans, dressed in combat fatigues and well worn uniforms, stepped up, and angrily, one after another for three straight hours, hurled their military medals, ribbons, discharge papers, and even a cane, onto the steps of the U.S. Capitol. Many of them paused to speak, expressing sentiments ranging from \"I pray that time will forgive me and my brothers for what we did\" to \"I got a purple heart and I hope I get another one fighting these mother-fuckers.\"[1]: p.113"
  },
  {
    "name": "Academy of United States Veterans",
    "website": null,
    "phone": null,
    "summary": "The Academy of United States Veterans (AUSV) is a professional honorary organization with the stated goal of advancing the profile of organizations and programs that help serve the veterans community."
  },
  {
    "name": "Air & Space Forces Association",
    "website": "https://www.afa.org/",
    "phone": "(703) 247-5800",
    "summary": "The Air & Space Forces Association (AFA) is an independent, 501(c)(3) non-profit, professional military association for the United States Air Force and United States Space Force. Headquartered in Arlington, Virginia, its declared mission is \"to educate the public about air and space power, to advocate for the world's most capable, most lethal, and most effective Air and Space Forces, and to support Airmen, Guardians, and their families.\"[5][2]"
  },
  {
    "name": "Air Force Sergeants Association",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Air+Force+Sergeants+Association%22",
    "phone": null,
    "summary": "The Air Force Sergeants Association (AFSA) is a non-profit organization representing the professional and personal interests of nearly 111,000 active, retired and veteran total enlisted members of the United States Air Force and their families."
  },
  {
    "name": "Airlift/Tanker Association",
    "website": "http://www.atalink.org",
    "phone": "(423) 902-2297",
    "summary": "The Airlift/Tanker Association (A/TA), formerly the Airlift Association, is an American non-profit organization that supports the United States Air Force's airlift and air mobility operations. The A/TA is a partner of the Air Mobility Command."
  },
  {
    "name": "American Ex-Prisoners of War",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22American+Ex-Prisoners+of+War%22",
    "phone": null,
    "summary": "American Ex-Prisoners of War is a service organization that aims to assist the surviving U.S. military and Civilian prisoner of war (POWs), particularly those who are elderly and those who have medical problems. Based in Arlington, Texas, the American Ex–Prisoners of War was founded in 1942.[1] It received a congressional charter under Title 36 of the United States Code in 1982. The group claims a membership of 12,000 members nationwide."
  },
  {
    "name": "American GI Forum",
    "website": "http://www.agifus.com/",
    "phone": null,
    "summary": "The American GI Forum (AGIF) is a congressionally chartered Hispanic veterans and civil rights organization founded in 1948. Its motto is \"Education is Our Freedom and Freedom should be Everybody's Business\". AGIF operates chapters throughout the United States, with a focus on veterans' issues, education, and civil rights. Its two largest national programs are the San Antonio-based Veterans Outreach Program, and the Dallas-based Service, Employment, Redevelopment-Jobs for Progress, Inc. (SER). The current National Commander is David Rodriguez.[1]"
  },
  {
    "name": "American Legion",
    "website": "http://legion.org",
    "phone": null,
    "summary": "The American Legion, commonly known as the Legion, is an organization of U.S. war veterans headquartered in Indianapolis, Indiana. It comprises state, U.S. territory, and overseas departments, in turn made up of local posts. It was established in March 1919 in Paris, France, by officers and men of the American Expeditionary Forces (A.E.F.).[1] It was subsequently chartered by the 66th U.S. Congress on September 16, 1919.[2]"
  },
  {
    "name": "American Veterans Center",
    "website": "http://www.amstudiescenter.org/",
    "phone": null,
    "summary": "The American Veterans Center is a non-profit educational organization and one of two programs of the American Studies Center. The mission of the American Veterans Center is \"to preserve and promote the legacy of America’s servicemen and women of every generation\"."
  },
  {
    "name": "American Veterans Committee",
    "website": "http://www.americanveteranscommittee.org",
    "phone": null,
    "summary": "Launched in April 2013, the American Veterans Committee (AVC) was a non-profit veterans organization that promoted networking opportunities for US veterans globally. The organization was launched to make it easier for US veterans to connect with veterans from other countries, expand new employment and business opportunities, while also promoting smart diplomacy.[1] The organization closed in 2023.[2]"
  },
  {
    "name": "American Veterans Committee (1943–2008)",
    "website": "https://www.nytimes.com/2001/03/16/national/16MEYE.html?ex=1205380800&en=0f2e749159999cab&ei=5070",
    "phone": null,
    "summary": "The American Veterans Committee was founded in 1943 as a liberal veterans organization and an alternative to groups such as the American Legion and the Veterans of Foreign Wars, which supported a conservative political and social agenda.[1] The organization's roots were planted in 1942 when Sgt. Gilbert Harrison began to correspond with fellow servicemen concerning an organization that expanded beyond the needs of military men. In 1943, the University Religious Conference at UCLA became a meeting place for the military men who shared this desire for a veterans organization that also advocated peace and justice. One year later in 1944, Charles Bolte joined the UCLA group and the American Veterans Committee was born. The founding group included Donald Prell. The new organization immediately began to publish the AVC Bulletin to document the organization's advocacy issues.[2]"
  },
  {
    "name": "American War Memorials Overseas",
    "website": "http://www.uswarmemorials.org/",
    "phone": "888-224-6108",
    "summary": "American War Memorials Overseas (AWMO) was founded in 2008 and is a non-profit corporation working to document, promote, and preserve non-government supported War Memorials honoring Americans outside of the United States. American War Memorials Overseas is a 501(c)(3) nonprofit corporation and as such is entirely dependent on donated funds.[1]"
  },
  {
    "name": "AMVETS",
    "website": "http://amvets.org",
    "phone": "(301) 459-9600",
    "summary": "American Veterans (AMVETS) is a non-partisan, volunteer-led organization formed by World War II veterans of the United States military. It advocates for its members as well as for causes that its members deem helpful to the nation at large. The group holds a Federal charter under Title 36 of the United States Code. It is a 501(c)19 organization."
  },
  {
    "name": "AO1 Foundation",
    "website": "https://www.ao1foundation.org/",
    "phone": null,
    "summary": "The Audience of One Foundation, commonly referred to as the AO1 Foundation, is an American non-profit foundation founded in July 2017 by then-Philadelphia Eagles quarterback Carson Wentz. The \"audience of one\" in the foundation's name refers to Jesus, as Wentz is a Christian.[1] The foundation operates through 3 ministries."
  },
  {
    "name": "Army and Navy Union of the United States of America",
    "website": "http://armyandnavyunion.org",
    "phone": "609-774-1660",
    "summary": "The Army and Navy Union (A&NU), formally the Army and Navy Union of the United States of America is the oldest veterans' organization in the United States. It was organized on March 31, 1888, in Ohio. Its name changed over time from just a soldier's union to take account for all sailors and soldiers in all branches of the United States Armed Forces."
  },
  {
    "name": "Army Wounded Warrior Program",
    "website": "http://www.military.com/features/0,15240,131303,00.html",
    "phone": null,
    "summary": "The Army Wounded Warrior Program (AW2) is the official U.S. Army program that assists and advocates for severely wounded, ill or injured Soldiers, Veterans, and their Families and Caregivers, wherever they are located, regardless of military status. Soldiers who qualify for AW2 are assigned to the program as soon as possible after arriving at the Warrior Transition Unit (WTU). AW2 supports these Soldiers and their Families throughout their recovery and transition, even into Veteran status. Through the local, personalized support of AW2 Advocates, AW2 strives to foster the Soldier's independence. There are more than 20,000  severely wounded, ill and injured Soldiers and Veterans currently enrolled in AW2."
  },
  {
    "name": "Association of Confederate Soldiers",
    "website": "https://web.archive.org/web/20070930165019/http://tennesseeencyclopedia.net/imagegallery.php?EntryID=U005",
    "phone": null,
    "summary": "The Association of Confederate Soldiers (Tennessee Division) was an organization formed by veterans of the American Civil War in 1887, and helped to form the United Confederate Veterans in 1889."
  },
  {
    "name": "Blinded Veterans Association",
    "website": "http://bva.org",
    "phone": "(844) 250-5180",
    "summary": "The Blinded Veterans Association (BVA) is a U.S non-profit organization that was established to \"help veterans and their families meet and overcome the challenges of blindness\"."
  },
  {
    "name": "Call of Duty Endowment",
    "website": "https://www.callofdutyendowment.org/",
    "phone": null,
    "summary": "The Call of Duty Endowment (C.O.D.E.) is a 501(c)(3) non-profit foundation co-created by Bobby Kotick, the former CEO of Activision Blizzard, and General James L. Jones, Jr., a retired United States Marine Corps four-star general, to help U.S., and later, U.K. military veterans find high-quality careers. The Endowment funds non-profit organizations that help former service members transition to high quality civilian careers after their military service and raises awareness of the value veterans bring to the workplace. The name of the Endowment is a reference to the video game series Call of Duty."
  },
  {
    "name": "Catholic War Veterans",
    "website": "http://cwv.org",
    "phone": null,
    "summary": "Catholic War Veterans (officially called the Catholic War Veterans of the United States of America) is a national service organization of baptized Catholics that have served or are currently serving in the United States Armed Forces.  Founded in 1935, the Catholic War Veterans are dedicated to serving all service members and their families regardless of their religion. Membership in the Catholic War Veterans is open to baptized Catholics, male or female, who have served on Active Duty for a period of at least 90 days, in the reserve component, or National Guard, or are currently on active duty in any branch of the military, specific war time service is not required."
  },
  {
    "name": "Cherokee Nation Warriors Society",
    "website": "https://web.archive.org/web/20120604110708/http://www.cherokeephoenix.org/1564/Article.aspx",
    "phone": null,
    "summary": "The Cherokee Nation Warriors Society is a society of Cherokee Nation tribal members who are also military veterans, and who were honorably discharged from military service.  The society is based in Tahlequah, Oklahoma, and is administered by the Cherokee Nation Office of Veterans Affairs.  Most of the society members participate in the Gourd Dance."
  },
  {
    "name": "CreatiVets",
    "website": "https://www.musichasvalue.com/",
    "phone": null,
    "summary": "CreatiVets is a United States non-profit organization that teaches United States Armed Forces veterans to use visual arts and music as a means of addressing their unseen wounds of war."
  },
  {
    "name": "D'Aniello Institute for Veterans and Military Families",
    "website": "http://ivmf.syracuse.edu",
    "phone": "315-443-0141",
    "summary": "The D'Aniello Institute for Veterans and Military Families (IVMF) is an interdisciplinary research institution that informs and advances the policy, economic and wellness concerns of the America’s veterans and families.[3] It is housed in the National Veterans Resource Center at Syracuse University. The IVMF annually serves thousands of U.S. veterans, service members, and their families around the world and as of 2024, the Institute had served 200,000 military service members, veterans, and their families through their programs.[4]"
  },
  {
    "name": "Disabled American Veterans",
    "website": "http://www.dav.org/",
    "phone": null,
    "summary": "The Disabled American Veterans (DAV) is an organization created in 1920 by World War I veterans for disabled military veterans of the United States Armed Forces that helps them and their families through various means. It was issued a federal charter by Congress in 1932. It currently has over 1 million members. As a 501(c)(4) social welfare organization, it is outside the purview of – and therefore not rated by – Charity Navigator.  DAV's Employer Identification Number (EIN) is 31–0263158."
  },
  {
    "name": "Disabled Veterans National Foundation",
    "website": "https://refill.toolforge.org/ng/result.php?page=Disabled_Veterans_National_Foundation&defaults=y",
    "phone": null,
    "summary": "The Disabled Veterans National Foundation (DVNF) is an American  registered charity that provides service for disabled veterans. Founded in 2007, the organization is based in Lanham, Maryland."
  },
  {
    "name": "Flags of Valor",
    "website": null,
    "phone": null,
    "summary": "Flags of Valor is an American small business that is veteran-owned and veteran-operated. Started in 2015 by Joe Shamess and Brian Steorts and located in Virginia, the business is notable for building wooden flags. The flags are crafted using 'American-sourced tools, supplies and material.’"
  },
  {
    "name": "Forty and Eight",
    "website": "http://fortyandeight.org",
    "phone": "(317) 634-1804",
    "summary": "La Société des 40 Hommes et 8 Chevaux (English: \"The Society of 40 Men and 8 Horses\"), commonly known as the Forty and Eight, is a patriotic organization of U.S. veterans headquartered in Indianapolis, Indiana. It is made up of state, U.S. territory, and overseas grande, and these are in turn made up of locale. It was founded in March 1920 at Philadelphia, Pennsylvania, as an honor society of The American Legion, by World War I veteran, and Legionnaire, Joseph William Breen."
  },
  {
    "name": "Freedom Station",
    "website": "https://web.archive.org/web/20101107011433/http://www.freedomstation.org/",
    "phone": null,
    "summary": "Freedom Station is a non-profit 501c charitable organization located in San Diego, California whose mission is to assist recovering injured military service members who are awaiting their retirement or discharge from their respective branch of the United States military service."
  },
  {
    "name": "Gary Sinise Foundation",
    "website": "https://www.garysinisefoundation.org/",
    "phone": "(615) 575-3500",
    "summary": "The Gary Sinise Foundation is a charity and veterans service organization that offers a variety of programs, services and events for wounded veterans of the military. It operates as a nonprofit 501(c)(3) organization.[1] Among its programs is the construction of specially adapted smart homes for severely wounded veterans that are provided mortgage-free.[2] From 2011 to 2021 the Gary Sinise Foundation has raised over $300 million for wounded veterans, first responders, and their families.[3]"
  },
  {
    "name": "Got Your 6",
    "website": "https://gotyour6.bobwoodrufffoundation.org/",
    "phone": null,
    "summary": "Got Your 6 is a national network of veteran service providers, managed by the Bob Woodruff Foundation.[1] In 2018, the Bob Woodruff Foundation acquired veteran nonprofit Got Your 6[2] and relaunched the brand in 2020[3] as the organization’s “enduring commitment to the veteran community.” The Got Your 6 Network includes community-based collaborative initiatives encompassing thousands of veteran-serving organizations, as well as individual partner organizations and programs. Through Got Your 6, the Bob Woodruff Foundation provides funding as well as no-cost learning and networking opportunities to help partners “achieve the maximum positive impact on their local veteran and military community.”[1] Got Your 6 also produces public awareness campaigns to show support for the military and veteran community and educate the public on ways to support veterans."
  },
  {
    "name": "Grand Army of the Republic",
    "website": "http://www.suvcw.org/?page_id=167",
    "phone": null,
    "summary": "The Grand Army of the Republic (GAR) was a fraternal organization composed of veterans of the Union Army (United States Army), Union Navy (U.S. Navy), and the Marines who served in the American Civil War. It was founded in 1866 in Decatur, Illinois, and grew to include thousands of \"posts\" (local community units) across the North and West. It was dissolved in 1956 at the death of its last member, Albert Woolson."
  },
  {
    "name": "Healing Heroes Network",
    "website": "https://www.healingheroes.org/",
    "phone": null,
    "summary": "Healing Heroes Network was a nonprofit organization providing financial assistance to veterans injured in the line of duty while in Iraq or Afghanistan on or after September 11, 2001.[1]"
  },
  {
    "name": "Honor Flight",
    "website": "https://www.pbs.org/newshour/rundown/2010/11/honor-flight-program-helps-vets-visit-wwii-memorial.html",
    "phone": null,
    "summary": "An Honor Flight is conducted by non-profit organizations dedicated to transporting as many United States military veterans as possible to see the memorials of the respective war(s) they fought in Washington, DC, at no cost to the veterans. These organizations are focused on bringing veterans of World War II to the National World War II Memorial, and any veteran with a terminal illness, to see the memorial of the war they fought in. Organizers plan to \"naturally transition\" their programs to focus on veterans of the Korean War, the Vietnam War, and subsequent wars as the veterans of those wars get older.[1][2]"
  },
  {
    "name": "Iraq and Afghanistan Veterans of America",
    "website": "http://iava.org/",
    "phone": "(202) 544-7692",
    "summary": "Iraq and Afghanistan Veterans of America (IAVA), is a nonprofit 501(c)(3) veterans organization founded by Paul Rieckhoff, an American writer, social entrepreneur, advocate, activist and veteran of the United States Army and the Iraq War. He served as an Army First Lieutenant and infantry rifle platoon leader in Iraq from 2003 through 2004. Rieckhoff was released from the Army National Guard in 2007."
  },
  {
    "name": "Iraq Veterans for Congress",
    "website": "http://www.foxbusiness.com/article/wall-street-journal-reuters-television-cover-iraq-vets-congress-dc_559115_1.html",
    "phone": null,
    "summary": "Iraq Veterans for Congress was a political organization consisting of military veterans who were Republican candidates for the United States House of Representatives in 2008."
  },
  {
    "name": "Iraq War Veterans Organization",
    "website": "https://web.archive.org/web/20051230142132/http://www.iraqwarveterans.org/",
    "phone": null,
    "summary": "The Iraq War Veterans Organization, or IWVO, was founded on April 12, 2003, by Russell K. Terry and William T. Hutchison. The original intent of the organization was to ensure that veterans returning from the war in Iraq, would not be subjected to the same treatment as veterans of the Vietnam War, in which both Terry and Hutchison served.  It has been largely defunct since 2010."
  },
  {
    "name": "Italian American War Veterans of the United States",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Italian+American+War+Veterans+of+the+United+States%22",
    "phone": null,
    "summary": "The Italian American War Veterans of the United States (ITAMVETS) is an Italian American veterans organization. The group was granted a congressional charter under Title 36 of the United States Code on November 20, 1981."
  },
  {
    "name": "Jewish War Veterans of the United States of America",
    "website": "http://www.jwv.org/",
    "phone": "202-265-6280",
    "summary": "Jewish War Veterans of the United States of America (also referred to as Jewish War Veterans of the U.S.A., Jewish War Veterans, or JWV) is an American Jewish veterans' organization created in 1896 by American Civil War veterans to raise awareness of contributions made by Jewish service members.[1][2]"
  },
  {
    "name": "K9s for Warriors",
    "website": "http://www.k9sforwarriors.org/",
    "phone": "904-686-1956",
    "summary": "K9s For Warriors is an American charity and veterans service organization that provides service dogs to veterans.[3] The organization trains rescue dogs to help veterans coping with post-traumatic stress disorder (PTSD), traumatic brain injury, military sexual trauma, post-9/11 issues and other psychological challenges associated with military service."
  },
  {
    "name": "Lao Veterans of America",
    "website": "http://www.laoveteransofamerica.org",
    "phone": null,
    "summary": "The Lao Veterans of America, Inc., describes itself as a non-profit, non-partisan, non-governmental, veterans organization that represents Lao- and Hmong-American veterans who served in the U.S. clandestine war in the Kingdom of Laos during the Vietnam War as well as their refugee families in the United States.[1]"
  },
  {
    "name": "Lao Veterans of America Institute",
    "website": "https://www.congress.gov/congressional-record/2014/12/12/extensions-of-remarks-section/article/e1840-1",
    "phone": null,
    "summary": "The Lao Veterans of America Institute (LVAI) is a national non-profit organization based in Fresno, and the Central Valley, of California, with chapters throughout California. It is one of the largest ethnic Lao- and Hmong-American veterans organizations representing tens of thousands of Lao Hmong veterans who served in the Vietnam War in the Royal Kingdom of Laos as well as their refugee families who were resettled in the United States after the conflict.[1][2]"
  },
  {
    "name": "Legion of Valor of the United States of America",
    "website": "http://legionofvalor.com",
    "phone": "(202) 320-3295",
    "summary": "The Legion of Valor of the United States of America, commonly known as the Legion of Valor, is a war veterans' organization created to promote patriotic allegiance, fidelity to the United States Constitution, and popular support for civil liberties and the permanence of free institutions.[1] Membership is open to recipients of the Medal of Honor, the Distinguished Service Cross, the Navy Cross, and the Air Force Cross.[2]"
  },
  {
    "name": "List Project",
    "website": "http://www.thelistproject.org/",
    "phone": null,
    "summary": "The List Project is a non-profit foundation that was established on June 20, 2007.[1] It assists Iraqi refugees who have worked for U.S-affiliated organizations throughout the Iraqi war[2] in obtaining visas and relocating to the U.S. \nIt is recognized as a U.S. 501(c)(3) non-profit organization under the Tides Center.[1][3]"
  },
  {
    "name": "Marine Corps League",
    "website": "http://mclnational.org",
    "phone": "(703) 207-9588",
    "summary": "The Marine Corps League is the only congressionally chartered United States Marine Corps-related veterans organization in the United States.  Its congressional charter was approved by the 75th U.S. Congress and signed by President Franklin D. Roosevelt on August 4, 1937.  The organization credits Major General John A. Lejeune, the 13th Marine Corps commandant, as one of its founding members."
  },
  {
    "name": "Michigan Veterans Affairs Agency",
    "website": "http://michiganveterans.com",
    "phone": null,
    "summary": "The Michigan Veterans Affairs Agency (MVAA) is a state government agency which is a part of the Department of Military and Veterans Affairs that functions as the central coordinating point for Michigan veterans, connecting those who have served in the U.S. Armed Forces, and their families, to services and benefits throughout the state."
  },
  {
    "name": "Military Officers Association of America",
    "website": "http://moaa.org",
    "phone": "800-234-6622",
    "summary": "The Military Officers Association of America (MOAA) is a professional association of United States military officers. It is a nonprofit organization that advocates for a strong national defense, but is politically nonpartisan.[citation needed]  The association supports government policies that benefit military members and their families. Its membership is made up of active duty, retired, and former commissioned officers and warrant officers from the uniformed services of the United States."
  },
  {
    "name": "Military Order of the Cootie",
    "website": "http://lotcs.org",
    "phone": "412-824-2240",
    "summary": "The Military Order of the Cootie of the United States (MOC, or simply Military Order of the Cootie) is a national honor degree membership association separately constituted as a subordinate and as an auxiliary order chartered by the Veterans of Foreign Wars of the United States (VFW).[1] The organization's services include supporting the VFW National Home and veterans hospitals.[2] Founded in 1920, it became a subsidiary of the VFW in 1923.[3][4][5]"
  },
  {
    "name": "Military Order of the Dragon",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Military+Order+of+the+Dragon%22",
    "phone": null,
    "summary": "The Military Order of the Dragon was an exclusive fraternal order founded in 1900 by members of the China Relief Expedition, a U.S. military force that participated in the Boxer Rebellion in Imperial China."
  },
  {
    "name": "Military Order of the Purple Heart",
    "website": "https://www.purpleheart.org/",
    "phone": null,
    "summary": "The Military Order of the Purple Heart (MOPH) is a congressionally chartered (Title 36 USC Chapter 1405) United States war veterans organization. Headquartered just outside Washington, D.C., it has a membership of approximately 45,300 veterans. It is unique in that its members are exclusively men and women who have received the Purple Heart award while serving as a member of the U.S. Military.[2]"
  },
  {
    "name": "Military Order of the Serpent",
    "website": "https://www.loc.gov/resource/gdcmassbookdig.historyoforganiz00tuck/?sp=15&st=image&r=-1.265,0.068,3.53,1.728,0",
    "phone": null,
    "summary": "Military Order of the Serpent (acronym MOS; nickname, Snaix;[1] established 1904) was an American secret society and veterans' fraternity organized in 1904, and incorporated on August 6, 1907.[2] The MOS received official recognition by the United Spanish War Veterans (USWV) at the Los Angeles encampment. It became the humorous branch of the USWV,[3] as devotion to the principles and objectives of USWV did not prevent a belief in humor.[4]"
  },
  {
    "name": "Military Veterans Advocacy",
    "website": "https://www.disabledveterans.org/mva-threatens-legal-action-over-inadequate-herbicide-rule/",
    "phone": null,
    "summary": "Military Veterans Advocacy is a Louisiana-based nonprofit organization that provides legal advocacy on behalf of the military and veterans.[1][2][3] The organization is focused on veterans’ health issues, such as toxic chemical exposure and Veterans Affairs benefit processing.[4][5]"
  },
  {
    "name": "Military Writers Society of America",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Military+Writers+Society+of+America%22",
    "phone": null,
    "summary": "The Military Writers Society of America, also known as the MWSA, is non-profit, 501(c)3 association of authors, poets, and artists, many of whom are U.S. military veterans or family members of veterans.  Membership is open to anyone with an interest in, affinity for, or connection to the military."
  },
  {
    "name": "The Mission Continues",
    "website": "https://www.washingtonpost.com/national-security/2021/11/10/veterans-day-2021-mission-continues",
    "phone": null,
    "summary": "The Mission Continues[1] is a 501(c)(3) national nonprofit organization[2]  that aims to empower military veterans to apply their skills and leadership abilities to benefit under-resourced communities. Established with the recognition that veterans possess a unique drive and dedication to serve, the organization seeks to harness these qualities to foster community development and support. By providing veterans with the tools and opportunities to continue their service beyond the military, the organization addresses the dual challenges of veteran reintegration and community underdevelopment.[3] They connect veterans with under-resourced communities, helping veteran volunteers collaborate with nonprofit partners.[4][5]"
  },
  {
    "name": "Montford Point Marine Association",
    "website": "http://montfordpointmarines.org",
    "phone": null,
    "summary": "The Montford Point Marine Association (MPMA) is a nonprofit military veterans' organization, founded to memorialize the legacy of the first African Americans to serve in the United States Marine Corps. The first African American U.S. Marines were trained  at Camp Montford Point, in Jacksonville, North Carolina, from 1941 to 1949."
  },
  {
    "name": "National Association for Black Veterans",
    "website": null,
    "phone": null,
    "summary": "The National Association for Black Veterans  (NABVETS) is a nationally certified Veterans Service Organization and a United States Department of Veterans Affairs claims representative. NABVETS has membership and chapters throughout the United States and Puerto Rico, providing personal advocacy on behalf of veterans seeking claims against the United States Department of Veterans Affairs. NABVETS' mission includes advocacy for youth and families, community involvement to help create positive lifestyles for veterans, and the empowerment of low-income and minority veterans.  NABVET also works to generate and preserve historical records.[1]"
  },
  {
    "name": "National Association of State Approving Agencies",
    "website": "http://www.nasaa-vetseducation.com",
    "phone": "804-225-2298",
    "summary": "National Association of State Approving Agencies (NASAA) is a member association that facilitates the efforts of its member State Approving Agencies (SAAs) in the United States of America, to promote and safeguard quality education and training programs for veterans, ensuring greater education and training opportunities for veterans, and protecting the integrity of the GI Bill.[1]"
  },
  {
    "name": "National Coalition for Homeless Veterans",
    "website": "https://web.archive.org/web/20100106215803/http://www.nchv.org/news_article.cfm?id=632",
    "phone": "202-546-1969",
    "summary": "The National Coalition for Homeless Veterans (NCHV) — an American 501(c)(3) nonprofit organization governed by a 17-member board of directors is a resource and technical assistance center for some community-based service providers and local, state and federal agencies that provide emergency and supportive housing, food, health services, job training and placement assistance, legal aid and case management support  for homeless veterans.[1]"
  },
  {
    "name": "Naval Enlisted Reserve Association",
    "website": "http://nera.org",
    "phone": null,
    "summary": "Naval Enlisted Reserve Association (NERA) is a military advocacy group in the United States, who specifically address the agenda of sea-service reservists. Their stated mission is to protect the rights and benefits of enlisted sea-service reservists such as promotion, pay, retirement benefits, personnel strength, and equipment. NERA is a prominent member of a powerful coalition of military advocacy groups dedicated to fighting for service members in the Nation's Capitol."
  },
  {
    "name": "Naval Order of the United States",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Naval+Order+of+the+United+States%22",
    "phone": null,
    "summary": "The Naval Order of the United States was established in 1890 as a hereditary organization in the United States for members of the American sea services.  Its primary mission is to encourage research and writing on naval and maritime subjects and preserve documents, portraits, and other records of prominent figures, deeds and memories of American naval and maritime history.[1]"
  },
  {
    "name": "Navy Musicians Association",
    "website": "http://www.navymusicians.org/",
    "phone": null,
    "summary": "The Navy Musicians Association (NMA) is a non-profit veterans organization of past and present United States Navy musicians. The NMA was founded in 1995 and has become a 501 (c) (19) tax exempt veteran's organization under the U.S. Tax Code."
  },
  {
    "name": "New Battlefront Foundation",
    "website": "http://www.newbattlefront.org/index.php?option=com_content&view=category&layout=blog&id=43&Itemid=59",
    "phone": null,
    "summary": "The New Battlefront Foundation is a non-profit organization whose mission is to aid veterans of the United States Armed Forces in their transition from military to civilian life.  The New Battlefront Foundation (NWB) was \"founded and operated by a disabled combat veteran\" in order to \"provide help navigating some of the troubles faced during a veteran's 'new battle' found upon returning home.\"[1]"
  },
  {
    "name": "Old Guard (New York)",
    "website": "https://nypost.com/2016/03/06/old-guard-vets-battling-to-keep-historic-headquarters/",
    "phone": null,
    "summary": "The Old Guard of the City of New York is a patriotic organization of U.S. veterans established as a ceremonial unit in New York City.  It was consolidated in 1868 when state legislation merged the predecessor organizations the New York Light Guard (1826, founded by Col. William W. Tompkins) and the New York City Guard (1833, founded by Capt. William M. McArdle).  Its longtime headquarters was at 307 W 91st St from 1920-2016, a historic building dating from 1896 by the architect Clarence True. The unit was known for its elaborate uniforms with bearskin caps, its participation at civic events, and its annual ball.[1][2] The Old Guard Headquarters are now located at 485 West 246th Street, Bronx, NY 10471."
  },
  {
    "name": "Operation Free",
    "website": "http://www.operationfree.net/",
    "phone": "(844)660-0084",
    "summary": "Operation Free is a coalition of veterans and national security organizations founded in August 2009 by the Truman National Security Project, The National Security Initiative, VoteVets.org, and VetPAC.  Operation Free, in collaboration with other organizations, works to raise awareness, among policymakers and the public, of the national security threat posed by climate change and the United States' reliance on oil.[1][2]"
  },
  {
    "name": "Order of Lafayette",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Order+of+Lafayette%22",
    "phone": null,
    "summary": "The Order of Lafayette is a fraternal organization of American military officers who served in France or French territory during World War I or World War II, as well as their descendants.[1][2]"
  },
  {
    "name": "Paralyzed Veterans of America",
    "website": "http://pva.org",
    "phone": "866-734-0857",
    "summary": "The Paralyzed Veterans of America was established in 1946 with the goal of serving the needs of disabled veterans. The organization was created to assist members, such as veterans of the armed forces living with spinal cord injuries or diseases like multiple sclerosis (MS) or amyotrophic lateral sclerosis (ALS) in living with increased independence and dignity."
  },
  {
    "name": "Pat Tillman Foundation",
    "website": "http://www.ptf.org",
    "phone": null,
    "summary": "The Pat Tillman Foundation is a non-profit organization created in 2004 by friends and family of former Arizona Cardinals safety turned U.S. Army Ranger Pat Tillman, including his widow Marie Tillman, in the aftermath of his fratricide death in Afghanistan.[3] In honor of his death, The Pat Tillman Foundation was created. The foundation supports the education and leadership development of veterans and military spouses primarily through its Tillman Scholars program.[4] The annual Pat's Run held in Tempe, Arizona since 2005 regularly draws nearly 30,000 participants every year in a 4.2 mile walk/run that finishes on the 42 yard line of Arizona State University's Sun Devil Stadium and helps fund scholarships and programs for Tillman Scholars.[3]"
  },
  {
    "name": "Pearl Harbor Survivors Association",
    "website": "http://grams.pacifichistoricparks.org/PDFs/Pearl-Harbor-Gram-Issue-7-1966.pdf",
    "phone": null,
    "summary": "The Pearl Harbor Survivors Association (PHSA), founded in 1958 and recognized by the United States Congress in 1985, was a World War II veterans organization whose members were on Pearl Harbor or three miles or less offshore during the Japanese attack on Pearl Harbor, on December 7, 1941. The PHSA was officially disbanded at the end of December 2011 with a membership of about 2,700 members nationally."
  },
  {
    "name": "Pin-ups for Vets",
    "website": "http://www.pinupsforvets.com",
    "phone": null,
    "summary": "Pin-ups For Vets is a non-profit charitable organization dedicated to helping injured and ill American Soldiers, Marines, Airmen, National Guard members, Coast Guard members and Sailors—and current active-duty personnel. The project, founded in 2006, is the work of UCLA graduate, Gina Elise who created a nonprofit organization which sells and distributes the Pin-Ups For Vets calendar, which hearkens back to 1940s and 1950-style vintage pin-girl images. The calendars are considered very tasteful by today's standards. The calendar feature female Veterans posing as WWII-style pin-ups.  To date, the organization has donated over $127,000 to help expand physical rehabilitation programs at veterans hospitals.  Pin-Ups For Vets Ambassadors have also personally visited with over 20,000 Veterans at VA Hospitals, Military Hospitals and State Veterans homes in 49 states across the Country to deliver gifts of appreciation over the past 19 years."
  },
  {
    "name": "Polish Army Veterans' Association in America",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Polish+Army+Veterans%27+Association+in+America%22",
    "phone": null,
    "summary": "The Polish Army Veterans' Association in America (Stowarzyszenie Weteranów Armii Polskiej w Ameryce, SWAP), founded in May 1921 is a Polish-American association for veterans of the Blue Army during World War I."
  },
  {
    "name": "Polish Combatants' Association (United States)",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Polish+Combatants%27+Association%22+United+States",
    "phone": null,
    "summary": "The Polish Combatants' Association (pl. Stowarzyszenie Polskich Kombatantów w Stanach Zjednoczonych, SPK),[1] organized in 1952, formally founded a year later, and terminated in 2012, was a Polish-American association for veterans of the Polish Armed Forces in the West during World War II. It was a member of the World Federation of Polish Combatants Association, an umbrella organization that included similar associations from other countries. The Association's President Janusz Krzyżanowski currently serves as the chairman of its liquidation committee, working to create a scholarly source of information about the SPK."
  },
  {
    "name": "Polish Legion of American Veterans",
    "website": "http://www.plav.org/index.htm",
    "phone": null,
    "summary": "The Polish Legion of American Veterans, USA (PLAV) is an organization made up of U.S. military veterans.  Despite its name, membership in the PLAV is open to all veterans regardless of race, color, religion or national origin. The PLAV motto is \"Unity with Heritage.\"[1]"
  },
  {
    "name": "Purple Heart Foundation",
    "website": "https://purpleheartfoundation.org/",
    "phone": "703-256-6139",
    "summary": "The Purple Heart Foundation is a 501(c)(3) non-profit organization headquartered in Annandale, Virginia.[1] Its declared purpose is \"to enhance the quality of life of Purple Heart recipients and other honorably discharged veterans and their families.\"[2][3]"
  },
  {
    "name": "Purple Hearts Reunited",
    "website": "https://purpleheartsreunited.org/",
    "phone": null,
    "summary": "Purple Hearts Reunited is a Vermont-based 501(c)(3) organization.  Founded in 2012, its purpose is to return Purple Hearts and other military awards that have become separated from the original recipients or their descendants.  In circumstances where the original recipient has died and no descendants can be located, Purple Hearts Reunited arranges to donate awards to suitable organizations, including museums."
  },
  {
    "name": "Reserve Officers Association",
    "website": "http://www.ROA.org/",
    "phone": null,
    "summary": "The ROA (d/b/a Reserve Organization of America) is a professional association of commissioned officers, non-commissioned officers, former officers, enlisted and spouses of the uniformed services of the United States, primarily with the Reserve and National Guard."
  },
  {
    "name": "Retired Enlisted Association",
    "website": "http://www.trea.org",
    "phone": null,
    "summary": "The Retired Enlisted Association (TREA) is a non-profit organization of the United States. Its mission is to enhance the quality of life for uniformed services enlisted personnel of the United States, their families and survivors - including active components, Reserves, and National Guard, and all retirees."
  },
  {
    "name": "Segs4Vets",
    "website": "http://www.segs4vets.org/",
    "phone": null,
    "summary": "Segs4Vets, a continuing program which began in 2005, is a grass-roots effort sustained and administered by volunteers in the United States that provide Segway PT vehicles to disabled United States military personnel. The program which made its first presentation in September 2005 to three recipients who had sustained injuries in Operation Iraqi Freedom (OIF), was conceived and implemented with the assistance of Gen. Ralph \"Ed\" Eberhart, USAF (Ret), President of the Armed Forces Benefits Association."
  },
  {
    "name": "Semper Fi & America's Fund",
    "website": "https://thefund.org/",
    "phone": "760-725-3680",
    "summary": "Semper Fi & America's Fund is a non-profit 501(c)(3) organization that provides a variety of programs to assist wounded veterans in all branches of the United States Armed Forces. The organization describes its mission as \"providing urgently needed resources and financial support for combat wounded, critically ill and catastrophically injured members\" of the U.S. Armed Forces and their families.[1] As of November 2023, Semper Fi & America's Fund (The Fund) has provided more than $312 million in assistance to over 31,000 service members and their families.[2]"
  },
  {
    "name": "Servicemembers United",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Servicemembers+United%22",
    "phone": null,
    "summary": "Servicemembers United (SU) was an LGBT-interest organization dedicated to the repeal of the United States armed forces' gay-exclusionary policy, commonly known as \"don't ask, don't tell\" (DADT). The organization, formerly known as \"Call to Duty\",[1] was formed in 2005 by several veterans.[2]"
  },
  {
    "name": "The Silver Star Families of America",
    "website": "http://www.silverstarfamilies.org/SSFOA-History.html",
    "phone": "417-743-2508",
    "summary": "The Silver Star Families of America (SSFOA) is a 501(c) tax exempt organization dedicated to honoring and supporting wounded, ill and injured veterans of all branches of the armed forces of the United States of America.[1] The organization was founded in 2004 by Steve and Diana Newton with the assistance of Joseph and Sharon Newton and the entire Newton family.[2]  It is not related to the military decoration designated the Silver Star."
  },
  {
    "name": "Social history of soldiers and veterans in the United States",
    "website": "https://archive.org/details/flintlocktomahaw0000leac",
    "phone": null,
    "summary": "The social history of soldiers and veterans in United States history covers the role of Army soldiers and veterans in the United States from colonial foundations to the present, with emphasis on the social, cultural, economic and political roles apart from strictly military functions. It also covers the militia and the National Guard."
  },
  {
    "name": "Society of the Army of Santiago de Cuba",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Society+of+the+Army+of+Santiago+de+Cuba%22",
    "phone": null,
    "summary": "Society of the Army of Santiago de Cuba was an organization, the purpose of which was to record the history and conserve the memory of the events of the campaign that resulted in the surrender, on July 17, 1898, of the Spanish army, the city of Santiago de Cuba, and the military province to which it pertained during the Spanish–American War."
  },
  {
    "name": "SoldierStrong",
    "website": "http://www.soldierstrong.org/",
    "phone": "888-898-3235",
    "summary": "SoldierStrong (formerly SoldierSocks) is a Stamford, Connecticut based 501(c)(3) charitable organization whose mission is to help America's military veterans take their next steps forward in life after service.[1]"
  },
  {
    "name": "SongwritingWith:Soldiers",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22SongwritingWith%3ASoldiers%22",
    "phone": null,
    "summary": "SongwritingWith:Soldiers (SW:S) is a 501(c)3 non-profit organization that pairs veterans and active-duty service members with professional songwriters in retreat settings to craft songs about combat and the return home."
  },
  {
    "name": "Space Force Association",
    "website": "http://ussfa.org",
    "phone": "855-732-2019",
    "summary": "The Space Force Association (SFA) is an independent, 501(c)(3) non-profit organization that serves as a professional military association, space advocacy group, and space education association for the United States Space Force and space professionals at large."
  },
  {
    "name": "Student Veterans of America",
    "website": "http://studentveterans.org",
    "phone": "(202) 223-4710",
    "summary": "Student Veterans of America (SVA), is a 501(c)(3) non-profit organization focused on addressing the needs and concerns of American military veterans in higher education. SVA is best known for being an umbrella organization for student veterans' groups that advocates for improvements in veterans educational benefits. Its efforts, combined with other veterans' service organizations, led to passage of the Post-9/11 Veterans Educational Assistance Act of 2008. Senator Jim Webb (D-VA), a lead sponsor of the legislation, has cited SVA's efforts as one of the primary reasons the new G.I. Bill was signed into law on June 30, 2008.[1]"
  },
  {
    "name": "Swords to Plowshares",
    "website": "https://www.va.gov/ogc/accreditation.asp",
    "phone": "(202) 495-5909",
    "summary": "Swords to Plowshares is a veterans service organization that provides job training, housing, and benefits advocacy to low income and homeless U.S. military veterans.  Since 1974, Swords to Plowshares has advocated on behalf of all veterans, providing services that are informed by the experiences of their clients. The agency operates two service centers for veterans to access resources and begin their path to housing, self-sufficiency, and/or healthcare. Swords to Plowshares also advocates for the rights and wellbeing of veterans at the federal, state, and local levels.[1]  It is a 501(c)(3) non-profit organization headquartered in San Francisco, supported by governmental and private grants, as well as donations from individuals.[2] Tramecia Garner is the executive director."
  },
  {
    "name": "Things We Read",
    "website": "https://web.archive.org/web/20141013183933/http://www.thingsweread.org/",
    "phone": null,
    "summary": "Things We Read (TWR) was a charity and military service organization that promoted reading by collecting book recommendations from influential citizens and donating books to members of the armed forces and local communities. It operated as a nonprofit 501(C)(3) organization.[2]"
  },
  {
    "name": "Transition Assistance Program",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Transition+Assistance+Program%22",
    "phone": null,
    "summary": "The Transition Assistance Program (TAP) is a U.S. Department of Defense (DoD) led program that provides information and training to ensure service members transitioning from active-duty are prepared for their next step in life - whether pursuing additional education, finding a job in the public or private sector, or starting their own business."
  },
  {
    "name": "Transition Training Academy",
    "website": null,
    "phone": null,
    "summary": "The Transition Training Academy (TTA)[1] was established as a joint effort of the United States Department of Labor (DoL), Veterans’ Employment and Training Service, Cisco, the Office of Disability Employment Policy (ODEP) and the Wounded Warrior Project (WWP). WWP administers the program as a part of their commitment to the service men and women that have been wounded or injured on active duty."
  },
  {
    "name": "Ukrainian American Veterans",
    "website": "http://www.uavets.org/",
    "phone": "847-825-1717",
    "summary": "The Ukrainian American Veterans (UAV, Ukrainian: Українські Американські Ветерани, romanized: Ukrains'ki Amerykans'ki Veterany)  is a 501(c)(19) non-profit organization of the United States, composed of Honorably Discharged Veterans of the United States Armed Forces, who are of Ukrainian heritage or descent. The UAV obtained its tax-exempt status from the IRS in 1984 and was incorporated in the State of New York in 1987.[1] The organization is governed by a volunteer National Executive Board (NEB), headed by a National Commander, elected at a National Convention."
  },
  {
    "name": "Uniformed Services Benefit Association",
    "website": "https://www.usba.com/",
    "phone": "800-821-7912",
    "summary": "The Uniformed Services Benefit Association (USBA) is a nonprofit organization headquartered in Overland Park, Kansas,[1] providing affordable group life insurance plans and other financial services specifically designed for active duty and retired military members and their families, as well as honorably discharged veterans, National Guard and Reserve members, and federal civilian employees.[2]"
  },
  {
    "name": "United Spanish War Veterans",
    "website": "https://ssawv.org/history/",
    "phone": "518-365-5244",
    "summary": "The United Spanish War Veterans was an American veterans' organization which consisted of veterans of the Spanish–American War, Philippine–American War and China Relief Expedition."
  },
  {
    "name": "United Spinal Association",
    "website": "https://rarediseases.org/organizations/united-spinal-association/",
    "phone": "617-249-7300",
    "summary": "United Spinal Association is a nonprofit membership, disability rights and veterans service organization in the United States. It was formed in 1946 as Eastern Paralyzed Veterans Association by a group of paralyzed World War II veterans from New York City.[1]"
  },
  {
    "name": "United States Army Volunteer Reserve Association",
    "website": null,
    "phone": null,
    "summary": "The United States Army Volunteer Reserve Association is a volunteer organization unaffiliated with any military unit or reserve unit. The Los Angeles Times called it a \"Phony Army unit\" and referred to them as \"faux military units\". The group was once very visible in parades and civil ceremonies, but politicians and the Reserve Association now stays on a low key.[1]"
  },
  {
    "name": "United States Submarine Veterans, Inc.",
    "website": "http://www.ussvi.org/",
    "phone": null,
    "summary": "The United States Submarine Veterans, Inc. (USSVI) is an organization created by a group from the United States Submarine Veterans of World War II. They shared a belief in the need for an organization open to all United States Navy submariners, from the very beginning of the Submarine Service to the present and into the future - not limited to just those who served so ably in World War II.  They wanted to ensure their shipmates who were killed in action on submarines would never be forgotten.[citation needed]"
  },
  {
    "name": "United States Submarine Veterans of World War II",
    "website": "http://uscode.house.gov/download/pls/36C2207.txt",
    "phone": null,
    "summary": "The United States Submarine Veterans of World War II is a congressionally chartered veterans organization that was established to \"perpetuate the memory of those shipmates who gave their lives in submarine warfare\" [1] during World War II."
  },
  {
    "name": "Veterans Benevolent Association",
    "website": "https://wikimediafoundation.org/",
    "phone": "415-839-6885",
    "summary": "The Veterans Benevolent Association (VBA) was an organization for LGBT veterans of the United States armed forces. The VBA was founded in New York City in 1945 by four honorably discharged gay veterans.[1]"
  },
  {
    "name": "Veterans for America",
    "website": "http://philanthropynewsdigest.org/npo-spotlight/veterans-for-america",
    "phone": null,
    "summary": "Veterans for America is \"an advocacy and humanitarian organization that works with its affiliate group, the Justice Project to engage the American public in support of policies addressing the needs of veterans, those currently in the armed services, and victims of war overseas, and to develop initiatives to make the world more secure.\"[1]"
  },
  {
    "name": "Veterans for Medical Cannabis Access",
    "website": "http://veteransformedicalmarijuana.org",
    "phone": null,
    "summary": "Veterans for Medical Cannabis Access (VMCA), which was founded as Veterans for Medical Marijuana Access (VMMA) reflecting the pejorative word \"marijuana\", is an Elliston, Virginia-based non-profit service organization designed to assist American veterans who wish to be able to use marijuana for medical purposes with a doctor's recommendation. VMCA works towards the freedom for veterans to discuss the medical use of marijuana with their doctors without the risk of reprisal."
  },
  {
    "name": "Veterans for Peace",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Veterans+for+Peace%22",
    "phone": null,
    "summary": "Veterans for Peace is an nonprofit membership organization[1] founded in 1985. The group works to promote alternatives to war. Initially made up of US military veterans of World War II, the Korean War and the Vietnam War - later including veterans of the Gulf War, the War in Afghanistan and the Iraq War - as well as peacetime veterans and non-veterans, it has since spread overseas and had an active offshoot in the United Kingdom called Veterans for Peace UK[2] from 2011 to 2022. The British offshoot of VFP, Veterans for Peace UK, was permanently shut down in August, 2022.[3][4]"
  },
  {
    "name": "Veterans Inc.",
    "website": "http://www.veteransinc.org",
    "phone": "(800) 482-2565",
    "summary": "Shrewsbury, Massachusetts"
  },
  {
    "name": "Veterans of Foreign Wars",
    "website": "http://www.vfw.org/",
    "phone": null,
    "summary": "The Veterans of Foreign Wars (VFW), formally the Veterans of Foreign Wars of the United States, is an organization of United States war veterans who fought in wars, campaigns, and expeditions on foreign land, waters, or airspace as military service members.[5][7] Established on September 29, 1899, in Columbus, Ohio,[8] the VFW is headquartered in Kansas City, Missouri.[2][1] It was federally chartered in 1936.[9]"
  },
  {
    "name": "Veterans' Alliance for Security and Democracy",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Veterans%27+Alliance+for+Security+and+Democracy%22",
    "phone": null,
    "summary": "The Veterans' Alliance for Security and Democracy (VETPAC) was a multi-candidate political action committee in the United States between 2004 and 2020.[1]"
  },
  {
    "name": "Vets For Freedom",
    "website": "https://www.usfca.edu/arts-sciences/programs/graduate/public-leadership",
    "phone": "(415) 422-7371",
    "summary": "Vets for Freedom is an American political advocacy organization founded in 2006 by veterans of the Iraq and Afghan wars, with connections to Republican Party leaders.[1] The group was initially founded as a 527 group.[1][2]"
  },
  {
    "name": "Vietnam Veterans Against the War",
    "website": "https://www.vvaw.org",
    "phone": null,
    "summary": "Vietnam Veterans Against the War (VVAW) is an American non-profit organization and corporation founded in 1967 to oppose the United States policy and participation in the Vietnam War. VVAW is a national veterans' organization that campaigns for peace, justice, and the rights of all United States military veterans. It publishes a twice-yearly newsletter, The Veteran; this was earlier published more frequently as 1st Casualty (1971–1972) and then as Winter Soldier (1973–1975)."
  },
  {
    "name": "Vietnam Veterans of America",
    "website": "http://vva.org/",
    "phone": "301-585-4000",
    "summary": "Vietnam Veterans of America, Inc. (VVA) is a national non-profit corporation founded in 1978 in the United States that is committed to serving the needs of all veterans. It is funded without any contribution from any branch of government. VVA is the only such organization chartered by the United States Congress and dedicated to Vietnam War veterans and their families. The group holds a congressional charter under Title 36 of the United States Code."
  },
  {
    "name": "Vietnam Veterans of America Foundation",
    "website": "https://www.google.com/search?as_eq=wikipedia&q=%22Vietnam+Veterans+of+America+Foundation%22",
    "phone": null,
    "summary": "The Vietnam Veterans of America Foundation (VVAF),[1] established in 1980, now the Veterans for America (VFA), is a Washington, D.C.-based international humanitarian organization that addresses the consequences of war and conflict. The founder of VVAF is Bobby Muller, a former U.S. Marine lieutenant and Vietnam veteran."
  },
  {
    "name": "Vietnamese American Armed Forces Association",
    "website": "http://www.vaafa.org",
    "phone": "714-386-9896",
    "summary": "The Vietnamese American Armed Forces Association (abbreviated: VAAFA), (Vietnamese: Hội Quân Nhân Người Mỹ Gốc Việt), is a non-profit, non partisan professional military association. It is the first military association for Vietnamese American service members in the United States.  Its members are Active, Reserve, National Guard, and Veterans of the U.S Armed Forces; Enlisted and Commissioned Officers from the five branches of the U.S. Military; U.S. Army, U.S. Marine Corps, U.S. Navy, U.S. Air Force, and U.S. Coast Guard and the two noncombatant uniformed services the National Oceanic and Atmospheric Administration Commissioned Corps (NOAAC) and the United States Public Health Service Commissioned Corps (PHSCC)."
  },
  {
    "name": "VoteVets.org",
    "website": "http://www.votevets.org",
    "phone": "(555) 555-5555",
    "summary": "VoteVets.org is a progressive political action committee (PAC) and 501(c)(4) nonprofit organization in the United States.[1][3][4][5][6][7]"
  },
  {
    "name": "Women's Overseas Service League",
    "website": "https://books.google.com/books?id=qj4X4TcvCG8C&pg=PA252",
    "phone": null,
    "summary": "The Women's Overseas Service League (WOSL) is a non-governmental organization based in the United States. It was founded in May 1921 to provide financial support and relationships for and between servicewomen who returned from World War I to no benefits, unlike their male counterparts.[1]"
  },
  {
    "name": "World War Veterans",
    "website": "http://www.marxisthistory.org/subject/usa/eam/worldwarveterans.html",
    "phone": null,
    "summary": "The World War Veterans (WWV) was established in 1919 as a progressive organization of American veterans of the First World War. It officially claimed to have been organized just 9 days after the armistice, on November 20, 1918 in Bois, France, while the group filed formal certificate of incorporation in New York state on February 13, 1919. The purposes of the corporation stated at that time included (1) To band together veterans of World War I who have served in any branch of the United States service; (2) To preserve the ideals for which these veterans served; and (3) To aid such veterans to secure adequate employment and to facilitate their return to civilian life."
  },
  {
    "name": "Yellow Ribbon Fund",
    "website": "https://yellowribbonfund.org/",
    "phone": "240-223-1180",
    "summary": "The Yellow Ribbon Fund (YRF) is a charity that primarily helps returning American service men & women, injured during active service, who are recovering at Walter Reed Army Medical Center and Bethesda Naval Hospital. The charity was founded on March 1, 2005[1] and is based in Bethesda, MD."
  },
  {
    "name": "Category:American Civil War veterans and descendants organizations",
    "website": "https://wikimediafoundation.org/",
    "phone": "415-839-6885",
    "summary": "This category refers to organizations formed of veterans of the American Civil War; their descendants created auxiliary organizations to honor the memories of those who served."
  },
  {
    "name": "Category:American Legion",
    "website": "https://wikimediafoundation.org/",
    "phone": "415-839-6885",
    "summary": "By consensus, this category should not contain biography articles."
  },
  {
    "name": "Category:Veterans of Foreign Wars",
    "website": "https://wikimediafoundation.org/",
    "phone": "415-839-6885",
    "summary": "This category has the following 2 subcategories, out of 2 total."
  },
  {
    "name": "Veterans Forge",
    "website": "https://veteransforge.org",
    "phone": "1 833 858 4338",
    "summary": "A nonprofit founded by veterans that provides specialized training in AI, emerging technologies, and career support to help US military veterans transition into tech careers."
  }
]
